Catalogs/Счета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Счета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Платформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключенКСтратегии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнтеграцияTInvestНСИ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура СинхронизироватьСчетаПользователя
// Получает список счетов пользователя из T-Invest API и синхронизирует их со справочником Счета.
// Результат:
// создаёт новые элементы справочника Счета
// обновляет существующие счета
// заполняет:
// Наименование
// AccountId
// ДатаОткрытия
// ДатаЗакрытия
// Активен
// Платформа
// ТипСчета
// Особенности:
// поиск счета выполняется по AccountId, затем по наименованию
// при изменениях выполняется запись элемента
Процедура СинхронизироватьСчетаПользователя() Экспорт
	
	СоединениеTInvest = ИнтеграцияTInvestAPI.TI_СоздатьHTTPСоединение();
	accounts = ИнтеграцияTInvestAPI.TI_ПолучитьСчетаПользователя(, СоединениеTInvest); //ОтветСервиса.accounts;
	
	Если Не ЗначениеЗаполнено(accounts) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого account Из accounts Цикл
		
		Счет = Справочники.Счета.НайтиПоРеквизиту("AccountId", account.id);
		Если ЗначениеЗаполнено(Счет) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по коду %2", Счет, account.id), Счет);
		Иначе
			Счет = Справочники.Счета.НайтиПоНаименованию(account.name, Истина);
			Если ЗначениеЗаполнено(Счет) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Найден счет %1 по наименованию %2", Счет, account.name), Счет);
			КонецЕсли;
		КонецЕсли;
		
		ЕстьИзменения = Ложь;
		Если ЗначениеЗаполнено(Счет) Тогда
			СчетОбъект = Счет.ПолучитьОбъект();
		Иначе
			СчетОбъект = Справочники.Счета.СоздатьЭлемент();
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан новый счёт %1 (%2)", account.name, account.id), Счет, , , ЕстьИзменения);
		КонецЕсли;
		
		Если СчетОбъект.Наименование <> account.name Тогда
			СчетОбъект.Наименование = account.name;
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменено наименование счёта %1 с %2 на %3", Счет, СчетОбъект.Наименование, account.name), Счет,,, ЕстьИзменения);
		КонецЕсли;
		
		Если СчетОбъект.AccountId <> account.id Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменён код счёта %1 с %2 на %3", Счет, СчетОбъект.AccountId, account.id), Счет, , , ЕстьИзменения);
			СчетОбъект.AccountId = account.id;
		КонецЕсли;
		
		ДатаОткрытия = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(Лев(account.openedDate, 19));
		Если СчетОбъект.ДатаОткрытия <> ДатаОткрытия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата открытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаОткрытия, ДатаОткрытия), Счет, , , ЕстьИзменения);
			СчетОбъект.ДатаОткрытия = ДатаОткрытия;
		КонецЕсли;
		
		ДатаЗакрытия = ИнтеграцияTInvestСлужебный.ПреобразоватьСтрокуВДату(Лев(account.closedDate, 19));
		Если СчетОбъект.ДатаЗакрытия <> ДатаЗакрытия Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменена дата закрытия счёта %1 с %2 на %3", Счет, СчетОбъект.ДатаЗакрытия, ДатаЗакрытия), Счет, , , ЕстьИзменения);
			СчетОбъект.ДатаЗакрытия = ДатаЗакрытия;
		КонецЕсли;
		
		СчетОбъект.Активен = account.status = "ACCOUNT_STATUS_OPEN";
		
		СчетОбъект.Платформа = Справочники.Платформы.ТИнвестиции;
		СчетОбъект.ТипСчета = account.type;
		
		Если ЕстьИзменения Тогда
			СчетОбъект.Записать();
		КонецЕсли;
		
//accessLevel	"ACCOUNT_ACCESS_LEVEL_READ_ONLY"
//closedDate	"1970-01-01T00:00:00Z"
//id	"2022875146"
//name	"ИИС"
//openedDate	"2020-03-23T00:00:00Z"
//status	"ACCOUNT_STATUS_OPEN"
//type	"ACCOUNT_TYPE_TINKOFF_IIS"
	КонецЦикла;
	
КонецПроцедуры // ПолучитьСчетаПользователя

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
